# Feature Selection

In [1]:
import pandas as pd
df=pd.DataFrame({
    "color": ["Red", "Green", "Blue","Green","Red"],
    "Size": ["Small", "medium","Large","medium","Small"],
    "City": ["Hyderabad","Delhi","Mumbai","Delhi","Chennai"],
    "Target": [10,20,15,25,12]
})
df

   color    Size       City  Target
0    Red   Small  Hyderabad      10
1  Green  medium      Delhi      20
2   Blue   Large     Mumbai      15
3  Green  medium      Delhi      25
4    Red   Small    Chennai      12

In [2]:
from sklearn.preprocessing import LabelEncoder

In [3]:
df["Color_Label"] =LabelEncoder().fit_transform(df["color"])
df[["color","Color_Label"]]

   color  Color_Label
0    Red            2
1  Green            1
2   Blue            0
3  Green            1
4    Red            2

In [4]:
one_hot=pd.get_dummies(df["color"],prefix="color") # if the value is there then it will be true and it will get the prefix as color
one_hot

   color_Blue  color_Green  color_Red
0       False        False       True
1       False         True      False
2        True        False      False
3       False         True      False
4       False        False       True

In [5]:
oh=pd.get_dummies(df,columns=["color"])
oh

     Size       City  Target  Color_Label  color_Blue  color_Green  color_Red
0   Small  Hyderabad      10            2       False        False       True
1  medium      Delhi      20            1       False         True      False
2   Large     Mumbai      15            0        True        False      False
3  medium      Delhi      25            1       False         True      False
4   Small    Chennai      12            2       False        False       True

In [6]:
from sklearn.preprocessing import OrdinalEncoder # takes the values based on order

In [7]:
order=[["Small","medium","Large"]]

df["Size_ordinal"]=OrdinalEncoder(categories=order).fit_transform(df[["Size"]])
df[["Size","Size_ordinal"]]

     Size  Size_ordinal
0   Small           0.0
1  medium           1.0
2   Large           2.0
3  medium           1.0
4   Small           0.0

In [8]:
te=df.groupby("City")["Target"].mean()
df["city_Target_Enc"]=df["City"].map(te)
df[["City","city_Target_Enc"]]

        City  city_Target_Enc
0  Hyderabad             10.0
1      Delhi             22.5
2     Mumbai             15.0
3      Delhi             22.5
4    Chennai             12.0

In [9]:
fe=df.groupby("City")["Target"].count()
df["city_Target_Enc"]=df["City"].map(fe)  #method 1
df[["City","city_Target_Enc"]]

        City  city_Target_Enc
0  Hyderabad                1
1      Delhi                2
2     Mumbai                1
3      Delhi                2
4    Chennai                1

In [10]:
df["city_Target_Enc"]=df["City"].map(fe) # method 2
df[["City","city_Target_Enc"]]

        City  city_Target_Enc
0  Hyderabad                1
1      Delhi                2
2     Mumbai                1
3      Delhi                2
4    Chennai                1

In [11]:
f=df["City"].value_counts()
f

City
Delhi        2
Hyderabad    1
Mumbai       1
Chennai      1
Name: count, dtype: int64

In [12]:
fe=df.groupby("City")["Target"].count()
fe

City
Chennai      1
Delhi        2
Hyderabad    1
Mumbai       1
Name: Target, dtype: int64